2009/pizzeria/app/controllers/crust_types_controller.rb

  def index
    @crust_types = CrustType.all
---
SELECT * FROM `crust_types`