2009/pizzeria/app/controllers/toppings_controller.rb

  def index
    @toppings = Topping.all
---
SELECT * FROM `toppings`

  def show
    @topping = Topping.find(params[:id])
---
SELECT * FROM `toppings` WHERE (`toppings`.`id` = 1)

  def create
    @topping = Topping.new(params[:topping])

    respond_to do |format|
      if @topping.save
---
INSERT INTO `toppings` (`updated_at`, `title`, `created_at`) VALUES('2009-07-30 20:55:18', 'Extra Cheese', '2009-07-30 20:55:18')